In [52]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
sns.set_style("darkgrid")

In [53]:
df = pd.read_csv('https://raw.githubusercontent.com/sidooms/MovieTweetings/master/latest/ratings.dat',
                names=['user_id','movie_id',
                        'rating','rating_timestamp'],
                 sep='::')

<ipython-input-53-6cffc5a49ba3>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  df = pd.read_csv('https://raw.githubusercontent.com/sidooms/MovieTweetings/master/latest/ratings.dat',

In [54]:
df.head()

   user_id  movie_id  rating  rating_timestamp
0        1    114508       8        1381006850
1        2    499549       9        1376753198
2        2   1305591       8        1376742507
3        2   1428538       1        1371307089
4        3     75314       1        1595468524

In [55]:
df['rating_timestamp'] = pd.to_datetime(df.rating_timestamp, unit='s')

In [56]:
df.tail()

        user_id  movie_id  rating    rating_timestamp
920075    71609   9893250      10 2021-02-20 21:45:51
920076    71609   9898858       3 2020-04-04 00:00:52
920077    71610    172495      10 2020-04-17 07:03:35
920078    71610    414387      10 2020-04-17 07:17:32
920079    71611   1623205       6 2013-03-09 12:37:35

In [80]:
df.shape

(920080, 4)

In [57]:
df.describe()

             user_id      movie_id         rating
count  920080.000000  9.200800e+05  920080.000000
mean    36075.940839  2.273391e+06       7.313012
std     20786.900371  2.183654e+06       1.852645
min         1.000000  8.000000e+00       0.000000
25%     18322.000000  7.638310e+05       6.000000
50%     36035.500000  1.727776e+06       8.000000
75%     53773.000000  2.975590e+06       9.000000
max     71611.000000  1.584208e+07      10.000000

3.a. How many users and movies are mentioned in the dataset?

In [58]:
print("There are {} unique users and {} unique movies in the dataset".format(df.user_id.nunique(),df.movie_id.nunique()))

There are 71611 unique users and 37953 unique movies in the dataset

3.b. How old are the data points (number of datapoints pr year)?

In [59]:
df.groupby(pd.DatetimeIndex(df['rating_timestamp']).year).count()

                  user_id  movie_id  rating  rating_timestamp
rating_timestamp
2013               170807    170807  170807            170807
2014               156354    156354  156354            156354
2015               123644    123644  123644            123644
2016               112455    112455  112455            112455
2017               105987    105987  105987            105987
2018                81870     81870   81870             81870
2019                74183     74183   74183             74183
2020                63115     63115   63115             63115
2021                31665     31665   31665             31665

3.c. How popular are popular movies - Looking at the data when will you say a movie is popular?

In [60]:
df.groupby(df['movie_id']).count().sort_values(['rating'],ascending=False)

          user_id  rating  rating_timestamp
movie_id
1454468      3104    3104              3104
816692       2961    2961              2961
8579674      2892    2892              2892
993846       2841    2841              2841
7286456      2757    2757              2757
...           ...     ...               ...
1114725         1       1                 1
1114718         1       1                 1
1111933         1       1                 1
1110059         1       1                 1
15842076        1       1                 1

[37953 rows x 3 columns]

3.d. How many long-tail movies are there?

In [72]:
df.groupby(df['movie_id']).count().sort_values(['rating'],ascending=False).describe()

            user_id        rating  rating_timestamp
count  37953.000000  37953.000000      37953.000000
mean      24.242616     24.242616         24.242616
std      113.308386    113.308386        113.308386
min        1.000000      1.000000          1.000000
25%        1.000000      1.000000          1.000000
50%        2.000000      2.000000          2.000000
75%        7.000000      7.000000          7.000000
max     3104.000000   3104.000000       3104.000000

Movies in this dataset have a median of two ratings each. How many movies have two or less ratings?

In [78]:
df.groupby(df['movie_id']).count().sort_values(['rating'],ascending=False).query(
    'rating <= 2').shape

(20979, 3)

25th Percentile of movies in this dataset have only 1 rating each. How many movies have only one rating?

In [79]:
df.groupby(df['movie_id']).count().sort_values(['rating'],ascending=False).query(
    'rating == 1').shape

(15709, 3)

3.e. How many movies has each user rated?

Most users have rated 1-2 movies. The highest 25% of users have rated 7 movies each. The user with the most ratings has written 2875 movie ratings.

In [81]:
df.groupby(df['user_id']).count().sort_values(['rating'],ascending=False).describe()

           movie_id        rating  rating_timestamp
count  71611.000000  71611.000000      71611.000000
mean      12.848305     12.848305         12.848305
std       45.559155     45.559155         45.559155
min        1.000000      1.000000          1.000000
25%        1.000000      1.000000          1.000000
50%        2.000000      2.000000          2.000000
75%        7.000000      7.000000          7.000000
max     2875.000000   2875.000000       2875.000000